tap "abhinav/tap"
tap "cesarferreira/tap"
tap "danielfoehrkn/switch"
brew "ast-grep"
brew "awscli"
brew "bash"
brew "bash-completion@2"
brew "bat"
brew "chezmoi"
brew "eslint"
brew "fd"
brew "flock"
brew "fzf"
brew "gh"
brew "git"
brew "gofumpt"
brew "gopls"
brew "lazygit"
brew "neovim"
brew "pandoc"
brew "ripgrep"
brew "shfmt"
brew "stylua"
brew "tree-sitter-cli"
brew "watch"
brew "cesarferreira/tap/stax"
brew "danielfoehrkn/switch/switch"
cask "claude-code"
cask "git-credential-manager"
cask "abhinav/tap/git-spice"
cask "orbstack"
go "golang.org/x/tools/cmd/callgraph"
go "github.com/go-delve/delve/cmd/dlv"
go "github.com/davidrjenni/reftools/cmd/fillswitch"
go "github.com/onsi/ginkgo/v2/ginkgo"
go "github.com/abice/go-enum"
go "mvdan.cc/gofumpt"
go "golang.org/x/tools/cmd/goimports"
go "github.com/twpayne/go-jsonstruct/v3/cmd/gojsonstruct"
go "github.com/golangci/golangci-lint/v2/cmd/golangci-lint"
go "github.com/segmentio/golines"
go "github.com/fatih/gomodifytags"
go "github.com/abenz1267/gomvp"
go "golang.org/x/tools/cmd/gonew"
go "golang.org/x/tools/gopls"
go "github.com/cweill/gotests/gotests"
go "gotest.tools/gotestsum"
go "golang.org/x/vuln/cmd/govulncheck"
go "github.com/koron/iferr"
go "github.com/josharian/impl"
go "github.com/tmc/json-to-struct"
go "go.uber.org/mock/mockgen"
go "github.com/kyoh86/richgo"
